XSLforXMLexercise/NewXMLResponse1.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://fedex.com/ws/ship/v17">
<soapenv:Body>
<ProcessShipmentRequest>
<WebAuthenticationDetail>
<UserCredential>
<Key>cvcvcvcvcvc</Key>
<Password>Qdw85uOfrATSpFRWNVlwx9IxJ</Password>
</UserCredential>
</WebAuthenticationDetail>
</ProcessShipmentRequest>
<ClientDetail>
<AccountNumber>510087100</AccountNumber>
<MeterNumber>118710470</MeterNumber>
</ClientDetail>
<Version>
<ServiceId>ship</ServiceId>
<Major>17</Major>
<Intermediate>0</Intermediate>
<Minor>0</Minor>
</Version>
<RequestedShipment>
<ShipTimestamp>2016-03-29T12:34:56-06:00</ShipTimestamp>
<DropoffType>REGULAR_PICKUP</DropoffType>
<ServiceType>FEDEX_GROUND</ServiceType>
<PackagingType>YOUR_PACKAGING</PackagingType>
</RequestedShipment>
<Shipper>
<Contact>
<PersonName>BrianPier 2</PersonName>
<CompanyName>ReactiveWorksItSolutionsPvt.Ltd</CompanyName>
<PhoneNumber>998877655</PhoneNumber>
</Contact>
<Address>
<StreetLines>148WestlakePoint</StreetLines>
<StreetLines>MainStreet</StreetLines>
<City>MONTGOMERY</City>
<StateOrProvinceCode>TX</StateOrProvinceCode>
<PostalCode>77356</PostalCode>
<CountryCode>US</CountryCode>
</Address>
</Shipper>
<Recipient>
<Contact>
<PersonName>John</PersonName>
<CompanyName>Acer Technlogies</CompanyName>
<PhoneNumber>3124676543</PhoneNumber>
</Contact>
<Address>
<StreetLine1>New yourk</StreetLine1>
<StreetLine2>InputYoscurInformation</StreetLine2>
<City>Collierville</City>
<StateOrProvinceCode>TN</StateOrProvinceCode>
<PostalCode>38017</PostalCode>
<CountryCode>US</CountryCode>
<ResidentialAddressIndicator>N</ResidentialAddressIndicator>
</Address>
</Recipient>
<ShippingChargesPayment>
<PaymentType>SENDER</PaymentType>
<Payor>
<ResponsibleParty>
<AccountNumber>510087100</AccountNumber>
<Address>
<PostalCode/>
<CountryCode>US</CountryCode>
</Address>
</ResponsibleParty>
</Payor>
</ShippingChargesPayment>
<LabelSpecification>
<LabelFormatType>COMMON2D</LabelFormatType>
<ImageType>Zpl</ImageType>
</LabelSpecification>
<PackageCount>2</PackageCount>
<RequestedPackageLineItems>
<Weight>
<Units>LB</Units>
<Value>30</Value>
</Weight>
<Dimensions>
<Length>12</Length>
<Width>15</Width>
<Height>10</Height>
<Units>IN</Units>
</Dimensions>
<Weight>
<Units>LB</Units>
<Value>30</Value>
</Weight>
<Dimensions>
<Length>20</Length>
<Width>20</Width>
<Height>20</Height>
<Units>CM</Units>
</Dimensions>
</RequestedPackageLineItems>
</soapenv:Body>
</soapenv:Envelope>
